<!DOCTYPE html>
<html>
<title>About</title>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" href="https://www.w3schools.com/w3css/4/w3.css">
<style>
body {font-family: "Times New Roman", Georgia, Serif;}
h1,h2,h3,h4,h5,h6 {
    font-family: "Playfair Display";
    letter-spacing: 5px;
}
</style>
<body>
<!-- Navbar (sit on top) -->
<div class="w3-top">
  <div class="w3-bar w3-white w3-padding w3-card" style="letter-spacing:4px;">
    <a href="facelockcate.php" class="w3-bar-item w3-button">Back to Lockcate</a>
  </div>
</div>

<!-- Header -->
<header class="w3-display-container w3-content w3-wide" style="max-width:1600px;min-width:500px" id="home">
  <img class="w3-image" src="/w3images/hamburger.jpg" alt="Hamburger Catering" width="1600" height="800">
  <div class="w3-display-bottomleft w3-padding-large w3-opacity">
    <h1 class="w3-xxlarge">Le Catering</h1>
  </div>
</header>

<!-- Page content -->
<div class="w3-content" style="max-width:1100px">

  <!-- About Section -->
  <div class="w3-row w3-padding-64" id="about">
    <div class="w3-col m6 w3-padding-large w3-hide-small">
     <img src="about.jpg" class="w3-round w3-image w3-opacity-min" alt="Table Setting" width="600" height="750">
    </div>

    <div class="w3-col m6 w3-padding-large">
      <h1 class="w3-center">ระบบการจัดการข้อมูลตลาดและงาน Event (Lockcate)</h1><br>
      <h5 class="w3-center">ที่มาและความสำคัญของปัญหา</h5>
      <p class="w3-large"> ในปัจจุบันมีร้านค้าเกิดขึ้นมากมายรวมไปถึงตลาดขายของและงาน Event ต่างๆเพราะคนไทยนิยมซื้อของที่ตลาดมากกว่าซื้อของในห้างเพราะสิ่งของในตลาดนั้นมีราคาที่ถูกและมีให้เลือกหลากหลายจึงทำให้หลายๆคนหันมาเปิดร้านค้าเพื่อหารายได้ อีกทั้งตลาดก็เกิดขึ้นมาใหม่เรื่อยๆทำให้พ่อค้าแม่ค้าจึงมีพื้นที่ในการขายของให้เลือกได้หลากหลายรวมถึงงาน Event ต่างๆก็เกิดขึ้นมากมายยิ่งเป็นช่วงฤดูหนาวก็จะมีงานเกิดขึ้น อาทิ เทศกาลดนตรี เทศกาลปิ้งย่าง และอื่นๆอีกมากมาย
      ดังนั้นผู้จัดทำจึงเล็งเห็นว่าสิ่งที่กล่าวมาข้างต้นนั้นมีความยุ่งยาก ซับซ้อนและไม่สะดวกในเรื่องการหาพื้นที่ตลาดและพื้นที่งาน Event จึงคิดที่จะนำเทคโนโลยีเข้ามาแก้ปัญหาในตรงจุดนี้โดยการสร้าง Website ขึ้นมาที่เกี่ยวข้องกับ ร้านค้า,ตลาดและงาน Event เพื่อรวบรวมให้ทุกอย่างมาอยู่ใน Website เดียวกัน ง่ายต่อการค้นหา เช่น หากร้านค้าต้องการขายของที่ตลาดสักแห่ง ร้านค้าก็เลือกตลาดที่จะไปขาย พอเลือกได้แล้วก็เข้าไปดูว่ามีพื้นที่ขายของว่างอยู่หรือไม่ หากพื้นที่ตรงนั้นยังไม่มีคนจองร้านค้าก็สามารถจองพื้นที่ตรงนั้นของตลาดได้โดยการจ่ายเงินทางออนไลน์และได้สลิปใบเสร็จมา ต่อมาก็นำใบเสร็จเข้าไปที่สำนักงานและตั้งร้านขายของได้เลย ทำให้เกิดความสะดวกในเรื่องของการจองพื้นที่และสะดวกในเรื่องเวลา ทางด้านงาน Event ก็เหมือนกัน หากงาน Event ต้องการหาร้านค้ามาขายของในงานก็สามารถเข้า Website เพื่อมาตามหาร้านค้าและติดต่อเพื่อขอให้ร้านค้ามาขายของในงานได้เช่นกัน
      <p>Problem</p> 
      เวลาที่ร้านค้าต้องการจะขายของสักที่ ร้านค้าจะต้องไปที่ตลาดก็จะเกิดปัญหาต่างๆรวมไปถึง คนจัดงาน Event ที่ต้องการจะหาร้านค้ามาขายของก็เกิดปัญหาเหมือนกัน เช่น
      -	งาน Event อาจจะพบร้านค้าที่ขายของไม่หลากหลาย 
      -	ร้านค้าไม่รู้ว่าในเร็วๆนี้จะมีงาน Event เกิดขึ้น
      -	ร้านค้าไม่สะดวกในการติดต่อไปจองพื้นที่ที่ตลาด</p>
      <p class="w3-large w3-text-grey w3-hide-medium">
      วัตถุประสงค์
      <br>
      1.	เพื่อเพิ่มความรวดเร็วในการจับจองพื้นที่แหล่งที่ขาย <br>
      2.	เพื่อให้ผู้ใช้บริการไม่ว่าจะเป็น ร้านค้า ตลาดและงาน Event ได้รับความสะดวกสะบายในการติดต่อกัน<br>
      3.	เพื่อให้ผู้ใช้บริการทราบข่าวสารงาน Event ต่างๆ<br>
      4.	เพื่อให้ทางตลาดมีความสะดวกในการติดต่อร้านค้าเข้ามาขายยังสถานที่ <br>
<br>
ขอบเขต
ระบบที่ได้พัฒนาขึ้นมีความสามารถ ดังต่อไปนี้ <br>
1.	สามารถรับเก็บข้อมูล ร้านค้า ตลาดและงาน Event ต่างๆได้ <br>
2.	สามาถทำให้ร้านค้าเลือกพื้นที่ตลาดและงาน Event ได้ <br>
3.	สามารถทำให้ตลาดติดต่อร้านเข้ามาขายในสถานที่ของตลาดได้รวดเร็ว <br>
<br>
ประโยชน์ที่คาดว่าจะได้รับ <br>
 1.	ผู้ขายสินค้ามีความสะดวกสะบายในการหาสถานที่ขาย <br>
 2.	ผู้ขายสินค้าได้รับข่าวสารงาน Event  ต่างๆ ได้อย่างรวดเร็ว <br>
 3.	ตลาดและงาน Event สามารถติดต่อกับทางร้านค้าที่สนใจได้โดยตรง <br>
 4.	สามารถชำระเงินในการเลือกพื้นที่ค้าขายได้สะดวกยิ่งขึ้น</p>
    </div>
  </div>

  <hr>

<!-- End page content -->
</div>
</body>
</html>













 
  




